In [3]:
import pandas as pd
try:
    data = pd.read_csv('Desktop/data/credit_scoring_eng.csv')
except:
    data = pd.read_csv('/datasets/credit_scoring_eng.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
import sys
import warnings
if not sys.warnoptions:
       warnings.simplefilter("ignore")

In [5]:
print('The shape of data:',data.shape)
print(data.head())

The shape of data: (21525, 12)
   children  days_employed  dob_years            education  education_id  \
0         1   -8437.673028         42    bachelor's degree             0
1         1   -4024.803754         36  secondary education             1
2         0   -5623.422610         33  Secondary Education             1
3         3   -4124.747207         32  secondary education             1
4         0  340266.072047         53  secondary education             1

       family_status  family_status_id gender income_type  debt  total_income  \
0            married                 0      F    employee     0     40620.102
1            married                 0      F    employee     0     17932.802
2            married                 0      M    employee     0     23341.752
3            married                 0      M    employee     0     42820.568
4  civil partnership                 1      F     retiree     0     25378.572

                   purpose
0    purchase of the house
1             car purchase
2    purchase of the house
3  supplementary education
4        to have a wedding

# Preprocessing Data

### Missing values

In [6]:
data.isna().sum()
data[data['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [7]:
data1 = data[data['days_employed'].isna()]
data1['gender'].value_counts()

F    1484
M     690
Name: gender, dtype: int64

 We found missing values in Days_emoployed and total_income columns

### Replacing missing values

#### Replacing missing values in total_income

In [8]:
data['total_income'].describe()

count     19351.000000
mean      26787.568355
std       16475.450632
min        3306.762000
25%       16488.504500
50%       23202.870000
75%       32549.611000
max      362496.645000
Name: total_income, dtype: float64

#### Since the mean and median is almost same this means that there is no outliners. Hence the missing values in total_income is replaced with mean of total_income

In [9]:

average_income = data['total_income'].mean()
data['total_income'] = data['total_income'].fillna(value = average_income)
average_days_employed = data['days_employed'].mean()

#### Replacing missing values in days_employed

#### converting negative values in days_employed to positive values

In [10]:
data['days_employed'] = data['days_employed'].abs()
data

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21520,1,4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions
21521,0,343937.404131,67,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car
21522,1,2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property
21523,3,3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car
21524,2,1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car

In [11]:
data['days_employed'].describe()

count     19351.000000
mean      66914.728907
std      139030.880527
min          24.141633
25%         927.009265
50%        2194.220567
75%        5537.882441
max      401755.400475
Name: days_employed, dtype: float64

In [12]:
data[data['days_employed'].isna()]['income_type'].value_counts()
# calulating the number of days with the income type

employee         1105
business          508
retiree           413
civil servant     147
entrepreneur        1
Name: income_type, dtype: int64

In [13]:
data['days_employed'].describe()# describe the data set in days emplozed

count     19351.000000
mean      66914.728907
std      139030.880527
min          24.141633
25%         927.009265
50%        2194.220567
75%        5537.882441
max      401755.400475
Name: days_employed, dtype: float64

#### from the above description it means that each income type has outliners, so median of each type is replaced with the missing value

In [14]:
data['days_employed'].fillna(data.groupby('income_type')['days_employed'].transform("median"), inplace = True)
data.isnull().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64


### Duplicate values

In [15]:
data['education'].value_counts()

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

#### identified that Education is case senitve, so change it to lower case.

In [16]:
data['education'] = data['education'].str.lower()

In [17]:
data['education'].value_counts()

secondary education    15233
bachelor's degree       5260
some college             744
primary education        282
graduate degree            6
Name: education, dtype: int64

In [18]:
data['family_status'].value_counts()# checking for duplicated values in family status

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

In [19]:
data['gender'].value_counts()# checking for duplicated values in gender

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [20]:
data['dob_years'].value_counts()# checking for duplicated values in age
data['dob_years'].describe()
# found '0' age in the dob_years column , replace this with mean age since there is no outliners
data['dob_years'] = data['dob_years'].replace(0, data['dob_years'].mean())
# find the data type of the column
data['dob_years'].dtype
#cahnge the data type from float to int
data['dob_years'] = data['dob_years'].astype(int)
data['dob_years'].dtype

dtype('int64')

In [21]:
data['dob_years'].describe()

count    21525.000000
mean        43.495145
std         12.218213
min         19.000000
25%         34.000000
50%         43.000000
75%         53.000000
max         75.000000
Name: dob_years, dtype: float64

In [22]:
data['children'].value_counts()# checking for duplicated values in number of children

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

In [23]:
data['children'] = data['children'].replace(-1, 0) # changing -1 values with 0
data['children'].value_counts()

0     14196
1      4818
2      2055
3       330
20       76
4        41
5         9
Name: children, dtype: int64

In [24]:
data['children'] = data['children'].replace(20, data['children'].median()) # changing 20 values with median of the column which is 0
data['children'].value_counts()

0    14272
1     4818
2     2055
3      330
4       41
5        9
Name: children, dtype: int64

# Categorizing Data

In [25]:
data.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,152.779569,50,secondary education,1,married,0,M,employee,0,21731.829,education
8,2,6929.865299,35,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

### Questions 1: Is there a connection between having kids and repaying a loan on time?

In [26]:
#  categorise children and debt 
children_category = data[['children', 'debt']]
children_category.head()
children_category.groupby('children').sum()

          debt
children
0         1072
1          444
2          194
3           27
4            4
5            0

In [27]:
# creating a function for alerting the debts, with kids and without kids
def children_alert(row):
    debt = row['debt']
    children = row['children']

    if  children != 0:
        if debt == 1:
            return 'With Kids Defaulting'      
    if children == 0:
        if debt == 1:
            return 'Without  Kids Defaulting'
    return 'No Defaulting'   
    
children_category['alert'] = children_category.apply(children_alert, axis=1) 
(children_category['alert'].value_counts()/len(children_category))*100


# This shows that having kids has no effect on defaulting the loan

No Defaulting               91.911731
Without  Kids Defaulting     4.980256
With Kids Defaulting         3.108014
Name: alert, dtype: float64

#### Conclusion:  This shows that having kids has no effect on defaulting the loan

### Question 2: Is there a connection between marital status and repaying a loan on time?

In [28]:
#  categorise family status and debt 

family_category = data[['family_status', 'debt']]
family_category.head()

# grouping with family status and debt sum
family_debt_sum  = family_category.groupby('family_status').sum()
family_debt_sum = family_debt_sum.rename(columns = {'debt' : 'debt_sum'})# rename debt column with debt_sum

# grouping with family status and debt count
family_debt_count  = family_category.groupby('family_status').count()
family_debt_count = family_debt_count.rename(columns = {'debt' : 'debt_count'}) #rename debt column with debt_count

# merging the sum and count data
family_grouped = family_debt_sum.merge(family_debt_count, on ='family_status' , how = 'left' )

#Finding the ratio of debt sum to debt count
family_grouped['ratio'] = (family_grouped['debt_sum'] / family_grouped['debt_count'])*100
print(family_grouped)

                   debt_sum  debt_count     ratio
family_status
civil partnership       388        4177  9.288963
divorced                 85        1195  7.112971
married                 931       12380  7.520194
unmarried               274        2813  9.740491
widow / widower          63         960  6.562500

#### Conclusion: Comparing with the number of customers defaulted in each category 
 Civil Partnership and unmarried has the highest defaulting rate compared to married and divorsed

### Question 3:  Is there a connection between income level and repaying a loan on time?

In [29]:
#  categorise income and debt 

income_category = data[['total_income', 'debt']]
income_category.head()
income_category.sort_values('total_income', ascending = True)
income_category['total_income'].describe()

def income_alert(row):
    debt = row['debt']
    income = row['total_income']

    if income < 30000 :
        if debt == 1:
            return 'High Risk'      
    if 30000>= income>= 60000 :
        if debt == 1:
            return 'Medium Risk'
    if  income > 60000 :
        if debt == 1:
            return 'low Risk'   
    return 'No Risk'   

income_category['alert'] = income_category.apply(income_alert, axis=1) 
income_category['alert'].value_counts()

No Risk      20182
High Risk     1305
low Risk        38
Name: alert, dtype: int64

#### Conclusion: Customers with Annual Income less than 30000 have a higher risk of loan defaulting

### Question 4: How do different loan purposes affect on-time loan repayment?

In [30]:
#  categorise purpose and debt 

purpose_category = data[['debt', 'purpose']]
purpose_category['purpose'].value_counts()

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
buying property for renting out             653
housing transactions                        653
transactions with commercial real estate    651
housing                                     647
purchase of the house                       647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
building a property                         620
purchase of my own house                    620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
car purchase                                462
supplementary education                     462
purchase of a car                           455
university education                        453
education                                   447
to get a supplementary education            447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

##### found soo much typos for a single loan category, so stemming the 'purpose' in 4 main categoris: Real Estate, Wedding, Car, Education Loans

In [31]:

from nltk.stem import SnowballStemmer 
english_stemmer = SnowballStemmer('english')
urpose_category = data[['debt', 'purpose']]
purposes = purpose_category['purpose']
new_purpose = []
for purpose in purposes:
    for word in purpose.split(' '):
        stemmed_word = english_stemmer.stem(word)
        #print(stemmed_word)
        if stemmed_word == 'wed':
            #print(purpose)
             purpose = purpose.replace(purpose , 'Wedding Loan')
            
        if stemmed_word == 'real' or  stemmed_word == 'hous' or  stemmed_word == 'properti':
            purpose = purpose.replace(purpose , 'Real Estate Loan')
            
        if stemmed_word == 'car':
            purpose = purpose.replace(purpose , 'Car Loan')
            
        if stemmed_word == 'educ' or  stemmed_word == 'univers':
            purpose = purpose.replace(purpose , 'Education Loan')
            

    new_purpose.append(purpose)
purpose_category['new_purpose'] = new_purpose 
#print(purpose_category)
purpose_category['new_purpose'].value_counts()
purpose_category.groupby('new_purpose')['debt'].sum()

new_purpose
Car Loan            403
Education Loan      370
Real Estate Loan    782
Wedding Loan        186
Name: debt, dtype: int64

In [32]:
# Now comparing it with debt 

# grouping with purpose status and debt sum
purpose_debt_sum  = purpose_category.groupby('new_purpose').sum()
purpose_debt_sum = purpose_debt_sum.rename(columns = {'debt' : 'debt_sum'})# rename debt column with debt_sum

# grouping with purpose  and debt count
purpose_debt_count  = purpose_category.groupby('new_purpose').count()
purpose_debt_count = purpose_debt_count.rename(columns = {'debt' : 'debt_count'}) #rename debt column with debt_count

# merging the sum and count data
purpose_grouped = purpose_debt_sum.merge(purpose_debt_count, on ='new_purpose' , how = 'left' )
purpose_grouped.drop(['purpose'], axis = 1 , inplace = True)

#Finding the ratio of debt sum to debt count
purpose_grouped['ratio'] = (purpose_grouped['debt_sum'] / purpose_grouped['debt_count'])*100
print(purpose_grouped)

                  debt_sum  debt_count     ratio
new_purpose
Car Loan               403        4315  9.339513
Education Loan         370        4022  9.199403
Real Estate Loan       782       10840  7.214022
Wedding Loan           186        2348  7.921635

#### Conclusion: The Car loan and Education Loan has higher risk of defaulting compared to Real estate and Wedding loan

# Conclusion

With the given data we came across the following conclusions:
- Customers with total income > 30000 are more likely to repay the loan
- Customers having children have no effect in the defaulting
- Widow Customers have higher repayment rate than married, civil partnership and unmarried
- Car Loan and Education Loan have higher risk of defaulting loan

In [33]:
data_pivot = data.pivot_table(index = 'family_status', columns = 'children', values = 'debt', aggfunc = 'sum')
data_pivot

children               0      1      2     3    4    5
family_status
civil partnership  232.0  118.0   30.0   8.0  0.0  0.0
divorced            56.0   21.0    7.0   1.0  0.0  NaN
married            520.0  246.0  145.0  17.0  3.0  0.0
unmarried          211.0   52.0    9.0   1.0  1.0  NaN
widow / widower     53.0    7.0    3.0   0.0  0.0  NaN

Family Status and Having kids shows than imbalanced data, eg, married with no kids have defaulted more than married with kids